In [290]:
import pandas as pd
import numpy as np

In [291]:
df = pd.read_excel("flight_price.xlsx")

In [292]:
df.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662

In [293]:
df.shape

(10683, 11)

In [294]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
dtypes: int64(1), object(10)
memory usage: 918.2+ KB

In [295]:
df.columns

Index(['Airline', 'Date_of_Journey', 'Source', 'Destination', 'Route',
       'Dep_Time', 'Arrival_Time', 'Duration', 'Total_Stops',
       'Additional_Info', 'Price'],
      dtype='object')

In [296]:
df["Airline"].unique()

array(['IndiGo', 'Air India', 'Jet Airways', 'SpiceJet',
       'Multiple carriers', 'GoAir', 'Vistara', 'Air Asia',
       'Vistara Premium economy', 'Jet Airways Business',
       'Multiple carriers Premium economy', 'Trujet'], dtype=object)

In [297]:
df["Date_of_Journey"]

0        24/03/2019
1         1/05/2019
2         9/06/2019
3        12/05/2019
4        01/03/2019
            ...
10678     9/04/2019
10679    27/04/2019
10680    27/04/2019
10681    01/03/2019
10682     9/05/2019
Name: Date_of_Journey, Length: 10683, dtype: object

In [298]:
df["Date_of_Journey"] = pd.to_datetime(df["Date_of_Journey"], infer_datetime_format = True)

In [299]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  datetime64[ns]
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
dtypes: datetime64[ns](1), int64(1), object(9)
memory usage: 918.2+ KB

In [300]:
df["Day"] = df["Date_of_Journey"].dt.day

In [301]:
df["Month"] = df["Date_of_Journey"].dt.month

In [302]:
df["Year"] = df["Date_of_Journey"].dt.year

In [303]:
df.drop("Date_of_Journey", axis=1, inplace=True)

In [304]:
df.head(2)

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Day,Month,Year
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24,3,2019
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,1,5,2019

In [305]:
df["Dep_Time"]

0        22:20
1        05:50
2        09:25
3        18:05
4        16:50
         ...
10678    19:55
10679    20:45
10680    08:20
10681    11:30
10682    10:55
Name: Dep_Time, Length: 10683, dtype: object

In [306]:
df["Dep_Hour"] = df["Dep_Time"].str.split(":").str[0]
df["Dep_Minutes"] = df["Dep_Time"].str.split(":").str[1]

In [307]:
df["Dep_Hour"] = df["Dep_Hour"].astype(int)

In [308]:
df["Dep_Minutes"] = df["Dep_Minutes"].astype(int)

In [309]:
df.head(2)

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Day,Month,Year,Dep_Hour,Dep_Minutes
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24,3,2019,22,20
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,1,5,2019,5,50

In [310]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Source           10683 non-null  object
 2   Destination      10683 non-null  object
 3   Route            10682 non-null  object
 4   Dep_Time         10683 non-null  object
 5   Arrival_Time     10683 non-null  object
 6   Duration         10683 non-null  object
 7   Total_Stops      10682 non-null  object
 8   Additional_Info  10683 non-null  object
 9   Price            10683 non-null  int64
 10  Day              10683 non-null  int64
 11  Month            10683 non-null  int64
 12  Year             10683 non-null  int64
 13  Dep_Hour         10683 non-null  int64
 14  Dep_Minutes      10683 non-null  int64
dtypes: int64(6), object(9)
memory usage: 1.2+ MB

In [311]:
df["Total_Stops"].unique()

array(['non-stop', '2 stops', '1 stop', '3 stops', nan, '4 stops'],
      dtype=object)

In [312]:
df.head(2)

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Day,Month,Year,Dep_Hour,Dep_Minutes
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24,3,2019,22,20
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,1,5,2019,5,50

In [313]:
df["Total_Stops"].value_counts()

1 stop      5625
non-stop    3491
2 stops     1520
3 stops       45
4 stops        1
Name: Total_Stops, dtype: int64

In [314]:
df.isnull().sum()

Airline            0
Source             0
Destination        0
Route              1
Dep_Time           0
Arrival_Time       0
Duration           0
Total_Stops        1
Additional_Info    0
Price              0
Day                0
Month              0
Year               0
Dep_Hour           0
Dep_Minutes        0
dtype: int64

In [315]:
df[df["Total_Stops"].isnull()]

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Day,Month,Year,Dep_Hour,Dep_Minutes
9039,Air India,Delhi,Cochin,NaN,09:45,09:25 07 May,23h 40m,NaN,No info,7480,6,5,2019,9,45

In [316]:
df["Total_Stops"] = df["Total_Stops"].map({"1 stop" : 1, "2 stops": 2, "non-stop": 0, "3 stops":3, "4 stops":4, "nan":1})

In [317]:
df["Total_Stops"]

0        0.0
1        2.0
2        2.0
3        1.0
4        1.0
        ...
10678    0.0
10679    0.0
10680    0.0
10681    0.0
10682    2.0
Name: Total_Stops, Length: 10683, dtype: float64

In [318]:
df["Duration_Hour"] = df["Duration"].str.split(" ").str[0].str.split("h").str[0]

In [319]:
df.head(2)

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Day,Month,Year,Dep_Hour,Dep_Minutes,Duration_Hour
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,0.0,No info,3897,24,3,2019,22,20,2
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2.0,No info,7662,1,5,2019,5,50,7

In [320]:
df["Duration_Minutes"] = df["Duration"].str.split(" ").str[1].str.split("m").str[0]

In [321]:
df.head(2)

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Day,Month,Year,Dep_Hour,Dep_Minutes,Duration_Hour,Duration_Minutes
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,0.0,No info,3897,24,3,2019,22,20,2,50
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2.0,No info,7662,1,5,2019,5,50,7,25

In [322]:
df[df["Duration_Hour"] == "5m"]

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Day,Month,Year,Dep_Hour,Dep_Minutes,Duration_Hour,Duration_Minutes
6474,Air India,Mumbai,Hyderabad,BOM → GOI → PNQ → HYD,16:50,16:55,5m,2.0,No info,17327,6,3,2019,16,50,5m,NaN

In [323]:
df.drop(6474, axis= 0, inplace=True)

In [324]:
df["Duration_Hour"] = df["Duration_Hour"].astype(int)

In [325]:
df["Duration_Minutes"].isnull().sum()

1031

In [326]:
df["Duration_Minutes"] = df["Duration_Minutes"].fillna(0)

In [327]:
df["Duration_Minutes"] = df["Duration_Minutes"].astype(int)

In [328]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10682 entries, 0 to 10682
Data columns (total 17 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Airline           10682 non-null  object
 1   Source            10682 non-null  object
 2   Destination       10682 non-null  object
 3   Route             10681 non-null  object
 4   Dep_Time          10682 non-null  object
 5   Arrival_Time      10682 non-null  object
 6   Duration          10682 non-null  object
 7   Total_Stops       10681 non-null  float64
 8   Additional_Info   10682 non-null  object
 9   Price             10682 non-null  int64
 10  Day               10682 non-null  int64
 11  Month             10682 non-null  int64
 12  Year              10682 non-null  int64
 13  Dep_Hour          10682 non-null  int64
 14  Dep_Minutes       10682 non-null  int64
 15  Duration_Hour     10682 non-null  int64
 16  Duration_Minutes  10682 non-null  int64
dtypes: float64(1), int64(8), object(8)
memory usage: 1.5+ MB

In [329]:
df.drop(["Duration", "Year"], axis = 1, inplace=True)

In [330]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10682 entries, 0 to 10682
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Airline           10682 non-null  object
 1   Source            10682 non-null  object
 2   Destination       10682 non-null  object
 3   Route             10681 non-null  object
 4   Dep_Time          10682 non-null  object
 5   Arrival_Time      10682 non-null  object
 6   Total_Stops       10681 non-null  float64
 7   Additional_Info   10682 non-null  object
 8   Price             10682 non-null  int64
 9   Day               10682 non-null  int64
 10  Month             10682 non-null  int64
 11  Dep_Hour          10682 non-null  int64
 12  Dep_Minutes       10682 non-null  int64
 13  Duration_Hour     10682 non-null  int64
 14  Duration_Minutes  10682 non-null  int64
dtypes: float64(1), int64(7), object(7)
memory usage: 1.3+ MB

In [331]:
df.drop(["Route"], axis = 1, inplace=True)

In [332]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10682 entries, 0 to 10682
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Airline           10682 non-null  object
 1   Source            10682 non-null  object
 2   Destination       10682 non-null  object
 3   Dep_Time          10682 non-null  object
 4   Arrival_Time      10682 non-null  object
 5   Total_Stops       10681 non-null  float64
 6   Additional_Info   10682 non-null  object
 7   Price             10682 non-null  int64
 8   Day               10682 non-null  int64
 9   Month             10682 non-null  int64
 10  Dep_Hour          10682 non-null  int64
 11  Dep_Minutes       10682 non-null  int64
 12  Duration_Hour     10682 non-null  int64
 13  Duration_Minutes  10682 non-null  int64
dtypes: float64(1), int64(7), object(6)
memory usage: 1.2+ MB

In [333]:
df.drop(["Dep_Time"], axis = 1, inplace=True)

In [334]:
df["Arrival_Time"]

0        01:10 22 Mar
1               13:15
2        04:25 10 Jun
3               23:30
4               21:35
             ...
10678           22:25
10679           23:20
10680           11:20
10681           14:10
10682           19:15
Name: Arrival_Time, Length: 10682, dtype: object

In [335]:
df["Arrival_Hour"] = df["Arrival_Time"].str.split(":").str[0]

In [336]:
df["Arrival_Minutes"] = df["Arrival_Time"].str.split(" ").str[0].str.split(":").str[1]

In [337]:
df.head(2)

,Airline,Source,Destination,Arrival_Time,Total_Stops,Additional_Info,Price,Day,Month,Dep_Hour,Dep_Minutes,Duration_Hour,Duration_Minutes,Arrival_Hour,Arrival_Minutes
0,IndiGo,Banglore,New Delhi,01:10 22 Mar,0.0,No info,3897,24,3,22,20,2,50,01,10
1,Air India,Kolkata,Banglore,13:15,2.0,No info,7662,1,5,5,50,7,25,13,15

In [338]:
df.drop(["Arrival_Time"], axis = 1, inplace=True)

In [339]:
df["Arrival_Hour"] =df["Arrival_Hour"].astype(int)
df["Arrival_Minutes"] =df["Arrival_Minutes"].astype(int)

In [340]:
df.head(5)

,Airline,Source,Destination,Total_Stops,Additional_Info,Price,Day,Month,Dep_Hour,Dep_Minutes,Duration_Hour,Duration_Minutes,Arrival_Hour,Arrival_Minutes
0,IndiGo,Banglore,New Delhi,0.0,No info,3897,24,3,22,20,2,50,1,10
1,Air India,Kolkata,Banglore,2.0,No info,7662,1,5,5,50,7,25,13,15
2,Jet Airways,Delhi,Cochin,2.0,No info,13882,9,6,9,25,19,0,4,25
3,IndiGo,Kolkata,Banglore,1.0,No info,6218,12,5,18,5,5,25,23,30
4,IndiGo,Banglore,New Delhi,1.0,No info,13302,1,3,16,50,4,45,21,35

In [341]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10682 entries, 0 to 10682
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Airline           10682 non-null  object
 1   Source            10682 non-null  object
 2   Destination       10682 non-null  object
 3   Total_Stops       10681 non-null  float64
 4   Additional_Info   10682 non-null  object
 5   Price             10682 non-null  int64
 6   Day               10682 non-null  int64
 7   Month             10682 non-null  int64
 8   Dep_Hour          10682 non-null  int64
 9   Dep_Minutes       10682 non-null  int64
 10  Duration_Hour     10682 non-null  int64
 11  Duration_Minutes  10682 non-null  int64
 12  Arrival_Hour      10682 non-null  int64
 13  Arrival_Minutes   10682 non-null  int64
dtypes: float64(1), int64(9), object(4)
memory usage: 1.2+ MB

In [342]:
df["Additional_Info"].unique()

array(['No info', 'In-flight meal not included',
       'No check-in baggage included', '1 Short layover', 'No Info',
       '1 Long layover', 'Change airports', 'Business class',
       'Red-eye flight', '2 Long layover'], dtype=object)

In [343]:
df.head()

,Airline,Source,Destination,Total_Stops,Additional_Info,Price,Day,Month,Dep_Hour,Dep_Minutes,Duration_Hour,Duration_Minutes,Arrival_Hour,Arrival_Minutes
0,IndiGo,Banglore,New Delhi,0.0,No info,3897,24,3,22,20,2,50,1,10
1,Air India,Kolkata,Banglore,2.0,No info,7662,1,5,5,50,7,25,13,15
2,Jet Airways,Delhi,Cochin,2.0,No info,13882,9,6,9,25,19,0,4,25
3,IndiGo,Kolkata,Banglore,1.0,No info,6218,12,5,18,5,5,25,23,30
4,IndiGo,Banglore,New Delhi,1.0,No info,13302,1,3,16,50,4,45,21,35

In [344]:
df[df["Total_Stops"].isnull()]

,Airline,Source,Destination,Total_Stops,Additional_Info,Price,Day,Month,Dep_Hour,Dep_Minutes,Duration_Hour,Duration_Minutes,Arrival_Hour,Arrival_Minutes
9039,Air India,Delhi,Cochin,NaN,No info,7480,6,5,9,45,23,40,9,25

In [345]:
df["Airline"]

0             IndiGo
1          Air India
2        Jet Airways
3             IndiGo
4             IndiGo
            ...
10678       Air Asia
10679      Air India
10680    Jet Airways
10681        Vistara
10682      Air India
Name: Airline, Length: 10682, dtype: object

In [357]:
df.groupby("Airline")["Price"].mean().round(-2).sort_values(ascending=False)

Airline
Jet Airways Business                 58400.0
Jet Airways                          11600.0
Multiple carriers Premium economy    11400.0
Multiple carriers                    10900.0
Air India                             9600.0
Vistara Premium economy               9000.0
Vistara                               7800.0
GoAir                                 5900.0
IndiGo                                5700.0
Air Asia                              5600.0
SpiceJet                              4300.0
Trujet                                4100.0
Name: Price, dtype: float64

In [358]:
df["Source"].unique()

array(['Banglore', 'Kolkata', 'Delhi', 'Chennai', 'Mumbai'], dtype=object)

In [359]:
df["Destination"].unique()

array(['New Delhi', 'Banglore', 'Cochin', 'Kolkata', 'Delhi', 'Hyderabad'],
      dtype=object)